{
  "jobDescription": "About the job\nMindsmith is a platform that incorporates AI to help corporate learning teams quickly author eLearning content.\n\n\nWe’re a scrappy, early-stage team (closed a pre-seed round of $875K) looking for the right engineering intern to join us in building and shaping the future of employee learning.\n\n\n\n\n\n\nCurrently, custom eLearning content is the most effective and desirable type of eLearning. However, building the content is time consuming and, therefore, expensive. On average, it takes 200 hours to create 1 hour of eLearning content.\n\n\n\n\n\n\nMindsmith uses AI to supercharge learning teams in their custom content production. They can upload internal documents for the AI to use as source material. They can also guide the AI in every step of the course creation process. For our current customers, we have increased their efficiency by 12-20x.\n\n\nCustom content generation is the first step in a larger vision of becoming the AI elearning infrastructure.\n\n\n\n\n\n\n👀 Why We’re Looking For You\n\n\nOur business has taken off in the last few months as we’ve focused on learning teams and developed a product that companies from enterprises to small and medium businesses are excited to use.\n\n\nAs we’ve grown, we’ve developed a backlog of feature requests that would take us to the next level of providing value to learning teams. Our 4-person engineering team have done all of the development so far, and we need help continuing to build the product.\n\n\n\n\n\n\n😎 About You You can build full stack web apps and ship user-facing features with JavaScript and modern, component-based JS frameworks like React and Next. You stay up to date with current trends and best practices in software architecture.\n\n\n\n\n\n\nReally smart: All of the things like solving hard problems, learning quickly, attention to detail, love for product iteration, skilled prioritizer, action-biased Mission-driven: You care about what you do Think like an founder: You’re not afraid of the occasional late-night hackathon. You aim to notice problems and fix them when you see them, without being prompted; your mental “finish line” is centered around helping get meaningful value fully into users’ hands.\n\n\n\n\n\n\nExperience with our Tech Stack:\n\n\nNext.js (frontend and backend)\nTypescript\nNode.js (microservices)\nTailwind CSS\nVercel\nGoogle Cloud Platform (GCP)\nBonus if you have experience with…\n\n\nBuilding authoring tools or similar projects (HUGE bonus)\nUI/UX design\nSeed/preseed-stage tech startup work\n\n\nBecause we’re a small, scrappy team right now, we still operate very lean and fast-paced. That means there are times when things may not be fleshed out perfectly or designs aren’t quite 100% polished when we need to start moving on something — just had to warn you up front, but you’re probably the kind of person who enjoys that kind of early-stage challenge :)\n\n\nWhat you'll do\n\n\n\nYou will QA Mindsmith's core features and collaborate with experienced engineers to build features. \n\n\n\nA few good things to know:\n\n\nOur team is small but powerful; you wouldn't believe what we've built in a short amount of time. We work alongside other amazing startups in a cool community of high-achieving engineers and founders (share an office space with Replay(https://www.getreplay.sale/) and hang out a lot with Buster, Zaymo, Relay, Devote, and Lovage) Our team operates most of our time remotely but get together in-person a twice a week to enable high productivity and collaboration.\n\n\n\n\n\n\n💰 What You’ll Get\n\n\n$20-$25 / hr, DOE;\nPotential full time SWE role after internship!\nOccasional meals and perks\nA fun, supportive team\nA super meaningful & impactful internship\nNot 100% sure you're a fit? Apply anyway! We look for potential more than anything else, and we expect that you will grow with us to take your career to new heights. We prefer candidates who are passionate about what we are building, avid learners, and have high standards for themselves over those who just check all the boxes or come from a certain pedigree.\n\n",
  "difficultyLevel": "Mid-Level",
  "yearsOfExperience": 3,
  "programmingLanguage": "7141952c-6122-4acb-9c54-888640991b1d",
  "selectedTopic": "e7ea4520-53d2-43ef-882c-4fc54317ab99"
}